from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمتك الإجابة على أسئلة المستخدم.",
    "سيتم تزويدك بمجموعة من الوثائق.",
    "يجب عليك توليد إجابة بناءً على الوثائق المقدمة فقط.",
    "يمكنك الاعتذار إذا لم تكن تعرف الإجابة.",
    "يجب عليك الإجابة بنفس لغة سؤال المستخدم.",
])
)
#### Document ####

document_prompt = Template(
    "\n".join([
        "## رقم الوثيقة: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####

footer_prompt = Template("\n".join([
    "بناءً على الوثائق المذكورة أعلاه فقط، يرجى توليد إجابة للمستخدم.",
    "### الإجابة:",
]))